Revit 2027 API
StructuralConnectionType.GetFamilySymbolId Method
 FamilySymbol of the annotation to use for this connection type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetFamilySymbolId()
Public Function GetFamilySymbolId As ElementId
public:
ElementId^ GetFamilySymbolId()
member GetFamilySymbolId : unit -> ElementId
Return Value
ElementId
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace